<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
   //数据库配置1
   'db_config1' => [
   // 数据库类型
   'type' => 'mysql',
   // 服务器地址
   'hostname' => '127.0.0.1',
   // 数据库名
   'database' => 'thinkphp',
   // 数据库用户名
   'username' => 'root',
   // 数据库密码
   'password' => '',
   // 数据库编码默认采用utf8
   'charset' => 'utf8',
   // 数据库表前缀
   'prefix' => 'think_',
   ],
   //数据库配置2
   'db_config2' => 'mysql://qpcr:qpcr2017@10.2.2.153:3306/qpcr#utf8',
];